mysql.org
#+title: MySQL IP Class Notebook
#+author: Nebhrajani A. V.
#+DATE:

* Hospital
  *mysql>* select * from HOSPITAL where NAME like '____';
+------+------+------+------------+-------------+--------+------+
| NO   | NAME | AGE  | DEPARTMENT | DATEOFADMIN | CHARGE | SEX  |
+------+------+------+------------+-------------+--------+------+
| 6    | Siju | 23   | Cardiology | 2006-10-10  | 800    | M    |
| 10   | Hari | 28   | Surgery    | 2006-03-19  | 450    | M    |
+------+------+------+------------+-------------+--------+------+
2 rows in set (0.00 sec)

*mysql>* update HOSPITAL set CHARGE=CHARGE-200 where SEX='F' and DEPARTMENT='Cardiology';

Query OK, 1 row affected (0.11 sec)

Rows matched: 1  Changed: 1  Warnings: 0

*mysql>* select * from HOSPITAL;
+------+----------+------+------------+-------------+--------+------+
| NO   | NAME     | AGE  | DEPARTMENT | DATEOFADMIN | CHARGE | SEX  |
+------+----------+------+------------+-------------+--------+------+
| 1    | Arpit    | 62   | Surgery    | 2006-01-21  | 300    | M    |
| 2    | Zayana   | 18   | ENT        | 2005-12-12  | 250    | F    |
| 3    | Kareem   | 68   | Orthopedic | 2006-02-19  | 450    | M    |
| 4    | Abhilash | 26   | Surgery    | 2006-11-24  | 450    | M    |
| 5    | Dhanya   | 24   | ENT        | 2006-10-20  | 350    | F    |
| 6    | Siju     | 23   | Cardiology | 2006-10-10  | 800    | M    |
| 7    | Ankita   | 16   | ENT        | 2006-04-13  | 100    | F    |
| 8    | Divya    | 20   | Cardiology | 2006-11-10  | 300    | F    |
| 9    | Nidhin   | 25   | Orthopedic | 2006-05-12  | 700    | M    |
| 10   | Hari     | 28   | Surgery    | 2006-03-19  | 450    | M    |
+------+----------+------+------------+-------------+--------+------+
10 rows in set (0.00 sec)

*mysql>* insert into HOSPITAL values (11, 'Rakesh', 45, 'ENT', 20080808, 1200, 'M'
);
ERROR 1406 (22001): Data too long for column 'CHARGE' at row 1
*mysql>* alter table HOSPITAL modify CHARGE char(4);
Query OK, 10 rows affected (1.96 sec)
Records: 10  Duplicates: 0  Warnings: 0

*mysql>* insert into HOSPITAL values (11, 'Rakesh', 45, 'ENT', 20080808, 1200, 'M'
);
Query OK, 1 row affected (0.08 sec)

*mysql>* delete from HOSPITAL where AGE>60;
Query OK, 2 rows affected (0.11 sec)

*mysql>* select * from HOSPITAL;
+------+----------+------+------------+-------------+--------+------+
| NO   | NAME     | AGE  | DEPARTMENT | DATEOFADMIN | CHARGE | SEX  |
+------+----------+------+------------+-------------+--------+------+
| 2    | Zayana   | 18   | ENT        | 2005-12-12  | 250    | F    |
| 4    | Abhilash | 26   | Surgery    | 2006-11-24  | 450    | M    |
| 5    | Dhanya   | 24   | ENT        | 2006-10-20  | 350    | F    |
| 6    | Siju     | 23   | Cardiology | 2006-10-10  | 800    | M    |
| 7    | Ankita   | 16   | ENT        | 2006-04-13  | 100    | F    |
| 8    | Divya    | 20   | Cardiology | 2006-11-10  | 300    | F    |
| 9    | Nidhin   | 25   | Orthopedic | 2006-05-12  | 700    | M    |
| 10   | Hari     | 28   | Surgery    | 2006-03-19  | 450    | M    |
| 11   | Rakesh   | 45   | ENT        | 2008-08-08  | 1200   | M    |
+------+----------+------+------------+-------------+--------+------+
9 rows in set (0.00 sec)

*mysql>* insert into HOSPITAL values (12, 'Rakhi', 45, 'ENT', 20070802, NULL, 'F')
;
Query OK, 1 row affected (0.06 sec)

*mysql>* insert into HOSPITAL values (13, 'Nishi', 45, NULL, 20090801, 450, 'F');
Query OK, 1 row affected (0.08 sec)

*mysql>* select * from HOSPITAL;
+------+----------+------+------------+-------------+--------+------+
| NO   | NAME     | AGE  | DEPARTMENT | DATEOFADMIN | CHARGE | SEX  |
+------+----------+------+------------+-------------+--------+------+
| 2    | Zayana   | 18   | ENT        | 2005-12-12  | 250    | F    |
| 4    | Abhilash | 26   | Surgery    | 2006-11-24  | 450    | M    |
| 5    | Dhanya   | 24   | ENT        | 2006-10-20  | 350    | F    |
| 6    | Siju     | 23   | Cardiology | 2006-10-10  | 800    | M    |
| 7    | Ankita   | 16   | ENT        | 2006-04-13  | 100    | F    |
| 8    | Divya    | 20   | Cardiology | 2006-11-10  | 300    | F    |
| 9    | Nidhin   | 25   | Orthopedic | 2006-05-12  | 700    | M    |
| 10   | Hari     | 28   | Surgery    | 2006-03-19  | 450    | M    |
| 11   | Rakesh   | 45   | ENT        | 2008-08-08  | 1200   | M    |
| 12   | Rakhi    | 45   | ENT        | 2007-08-02  | NULL   | F    |
| 13   | Nishi    | 45   | NULL       | 2009-08-01  | 450    | F    |
+------+----------+------+------------+-------------+--------+------+
11 rows in set (0.00 sec)

*mysql>* select count(DEPARTMENT) from HOSPITAL;
+-------------------+
| count(DEPARTMENT) |
+-------------------+
|                10 |
+-------------------+
1 row in set (0.00 sec)

*mysql>* select count(*) from HOSPITAL;
+----------+
| count(*) |
+----------+
|       11 |
+----------+
1 row in set (0.00 sec)

*mysql>* select SUM(CHARGE) from HOSPITAL where SEX='F';
+-------------+
| SUM(CHARGE) |
+-------------+
|        1450 |
+-------------+
1 row in set (0.00 sec)

