mysql.org
* Schoolbus
*mysql>* select * from Schoolbus where CAPACITY>NOOFSTUDENTS order by RTNO;
#+begin_example

+------+-------------+----------+--------------+----------+---------------+---------+
| RTNO | AREACOVERED | CAPACITY | NOOFSTUDENTS | DISTANCE | TRANSPORTER   | CHARGES |
+------+-------------+----------+--------------+----------+---------------+---------+
| 11   | Moti Bagh   | 35       | 32           | 10       | Kisan Tours   | 35000   |
| 3    | Pitampura   | 60       | 55           | 30       | Anand Travels | 60000   |
+------+-------------+----------+--------------+----------+---------------+---------+

#+end_example
2 rows in set (0.04 sec)

*mysql>* Select AREACOVERED from SchoolBus where DISTANCE>20 and CHARGES<80000;
+-------------+
| AREACOVERED |
+-------------+
| Pitampura   |
+-------------+
1 row in set (0.13 sec)

*mysql>* Select TRANSPORTER, sum(NOOFSTUDENTS) from Schoolbus group by TRANSPORTER;
+----------------+-------------------+
| TRANSPORTER    | sum(NOOFSTUDENTS) |
+----------------+-------------------+
| Anand Travels  |               225 |
| Bhalla Co.     |                60 |
| Kisan Tours    |               132 |
| Shivam Travels |               120 |
| Speed Travels  |               160 |
| Yadav Co.      |               190 |
+----------------+-------------------+
6 rows in set (0.06 sec)

*mysql>* Select TRANSPORTER, sum(NOOFSTUDENTS) from Schoolbus group by TRANSPORTER Order by 2 DESC;
+----------------+-------------------+
| TRANSPORTER    | sum(NOOFSTUDENTS) |
+----------------+-------------------+
| Anand Travels  |               225 |
| Yadav Co.      |               190 |
| Speed Travels  |               160 |
| Kisan Tours    |               132 |
| Shivam Travels |               120 |
| Bhalla Co.     |                60 |
+----------------+-------------------+
6 rows in set (0.00 sec)

*mysql>* select RTNO, AREACOVERED, CHARGES/NOOFSTUDENTS as "AVERAGE COST PER STUDENT" from SchoolBus;
+------+---------------+--------------------------+
| RTNO | AREACOVERED   | AVERAGE COST PER STUDENT |
+------+---------------+--------------------------+
| 1    | Vasant Kunj   |        833.3333333333334 |
| 2    | Hauz Khas     |                   1062.5 |
| 3    | Pitampura     |        1090.909090909091 |
| 4    | Rohini        |        1111.111111111111 |
| 5    | Yamuna Vihar  |        916.6666666666666 |
| 6    | Krishna Nagar |                     1000 |
| 7    | Vasundhara    |        909.0909090909091 |
| 8    | Paschim Vihar |                     1375 |
| 9    | Saket         |        833.3333333333334 |
| 10   | Jank Puri     |                      950 |
| 11   | Moti Bagh     |                  1093.75 |
+------+---------------+--------------------------+
11 rows in set (0.06 sec)

*mysql>* Insert into SchoolBus values (11, "Moti Bagh", 35, 32, 10, "Kisan Tours", 35000);
Query OK, 1 row affected (0.66 sec)

*mysql>* Select sum(DISTANCE) from SchoolBus where TRANSPORTER='Yadav Co.';
+---------------+
| sum(DISTANCE) |
+---------------+
|            50 |
+---------------+
1 row in set (0.02 sec)

*mysql>* Select min(NOOFSTUDENTS) from SchoolBus;
+-------------------+
| min(NOOFSTUDENTS) |
+-------------------+
| 100               |
+-------------------+
1 row in set (0.00 sec)

*mysql>* Select avg(CHARGES) from SchoolBus where TRANSPORTER='Anand Travels';
+-------------------+
| avg(CHARGES)      |
+-------------------+
| 81666.66666666667 |
+-------------------+
1 row in set (0.01 sec)

*mysql>* Select Distinct TRANSPORTER from SchoolBUs;
+----------------+
| TRANSPORTER    |
+----------------+
| Shivam Travels |
| Anand Travels  |
| Bhalla Co.     |
| Yadav Co.      |
| Speed Travels  |
| Kisan Tours    |
+----------------+
6 rows in set (0.00 sec)

* Graduate
*mysql>* Select NAME from GRADUATE where DIVI="I" order by NAME;
+---------+
| NAME    |
+---------+
| ARJUN   |
| DIVYA   |
| DIWAKAR |
| JOHN    |
| KARAN   |
| REKHA   |
| ROBERT  |
| RUBINA  |
+---------+
8 rows in set (0.02 sec)

*mysql>* Select NAME, STIPEND, SUBJECT, STIPEND*12 as "AMOUNT OF STIPEND RECIEVED IN A YEAR" from GRADUATE;
+---------+---------+-----------+--------------------------------------+
| NAME    | STIPEND | SUBJECT   | AMOUNT OF STIPEND RECIEVED IN A YEAR |
+---------+---------+-----------+--------------------------------------+
| KARAN   | 400     | PHYSICS   |                                 4800 |
| DIWAKAR | 450     | COMP SC   |                                 5400 |
| DIVYA   | 300     | CHEMISTRY |                                 3600 |
| REKHA   | 350     | PHYSICS   |                                 4200 |
| ARJUN   | 500     | MATHS     |                                 6000 |
| SABINA  | 400     | CHEMISTRY |                                 4800 |
| JOHN    | 250     | PHYSICS   |                                 3000 |
| ROBERT  | 450     | MATHS     |                                 5400 |
| RUBINA  | 500     | COMP SC   |                                 6000 |
| VIKAS   | 400     | MATHS     |                                 4800 |
+---------+---------+-----------+--------------------------------------+
10 rows in set (0.00 sec)

*mysql>* select count(*) from GRADUATE where SUBJECT="PHYSICS" or SUBJECT="COMP SC";
+----------+
| count(*) |
+----------+
|        5 |
+----------+
1 row in set (0.05 sec)

*mysql>* insert into GRADUATE values (11, "KAJOL", 300, "COMP SC", 75, 1);
Query OK, 1 row affected (0.11 sec)

*mysql>* Select min(AVERAGE) from GRADUATE where SUBJECT="PHYSICS";
+--------------+
| min(AVERAGE) |
+--------------+
| 63           |
+--------------+
1 row in set (0.00 sec)

*mysql>* Select SUM(STIPEND) from GRADUATE where DIVI="II";
+--------------+
| SUM(STIPEND) |
+--------------+
|          800 |
+--------------+
1 row in set (0.00 sec)

*mysql>* Select AVG(STIPEND) from GRADUATE where AVERAGE>=65;
+--------------+
| AVG(STIPEND) |
+--------------+
|          420 |
+--------------+
1 row in set (0.00 sec)

*mysql>* select COUNT(DIstinct SUBJECT) from GRADUATE;
+-------------------------+
| COUNT(DIstinct SUBJECT) |
+-------------------------+
|                       4 |
+-------------------------+
1 row in set (0.06 sec)

