mysql.tex

\section{Schoolbus}
\label{sec:orge313513}
\textbf{mysql>} select * from Schoolbus where CAPACITY>NOOFSTUDENTS order by RTNO;
\begin{verbatim}

+------+-------------+----------+--------------+----------+---------------+---------+
| RTNO | AREACOVERED | CAPACITY | NOOFSTUDENTS | DISTANCE | TRANSPORTER   | CHARGES |
+------+-------------+----------+--------------+----------+---------------+---------+
| 11   | Moti Bagh   | 35       | 32           | 10       | Kisan Tours   | 35000   |
| 3    | Pitampura   | 60       | 55           | 30       | Anand Travels | 60000   |
+------+-------------+----------+--------------+----------+---------------+---------+

\end{verbatim}
2 rows in set (0.04 sec)

\textbf{mysql>} Select AREACOVERED from SchoolBus where DISTANCE>20 and CHARGES<80000;
\begin{center}
\begin{tabular}{|l|}
\hline
AREACOVERED \\
\hline
Pitampura \\
\hline
\end{tabular}
\end{center}
1 row in set (0.13 sec)

\textbf{mysql>} Select TRANSPORTER, sum(NOOFSTUDENTS) from Schoolbus group by TRANSPORTER;
\begin{center}
\begin{tabular}{|l|l|}
\hline
TRANSPORTER & sum(NOOFSTUDENTS) \\
\hline
Anand Travels & 225 \\
Bhalla Co. & 60 \\
Kisan Tours & 132 \\
Shivam Travels & 120 \\
Speed Travels & 160 \\
Yadav Co. & 190 \\
\hline
\end{tabular}
\end{center}
6 rows in set (0.06 sec)

\textbf{mysql>} Select TRANSPORTER, sum(NOOFSTUDENTS) from Schoolbus group by TRANSPORTER Order by 2 DESC;
\begin{center}
\begin{tabular}{|l|l|}
\hline
TRANSPORTER & sum(NOOFSTUDENTS) \\
\hline
Anand Travels & 225 \\
Yadav Co. & 190 \\
Speed Travels & 160 \\
Kisan Tours & 132 \\
Shivam Travels & 120 \\
Bhalla Co. & 60 \\
\hline
\end{tabular}
\end{center}
6 rows in set (0.00 sec)

\textbf{mysql>} select RTNO, AREACOVERED, CHARGES/NOOFSTUDENTS as "AVERAGE COST PER STUDENT" from SchoolBus;
\begin{center}
\begin{tabular}{|l|l|l|}
\hline
RTNO & AREACOVERED & AVERAGE COST PER STUDENT \\
\hline
1 & Vasant Kunj & 833.3333333333334 \\
2 & Hauz Khas & 1062.5 \\
3 & Pitampura & 1090.909090909091 \\
4 & Rohini & 1111.111111111111 \\
5 & Yamuna Vihar & 916.6666666666666 \\
6 & Krishna Nagar & 1000 \\
7 & Vasundhara & 909.0909090909091 \\
8 & Paschim Vihar & 1375 \\
9 & Saket & 833.3333333333334 \\
10 & Jank Puri & 950 \\
11 & Moti Bagh & 1093.75 \\
\hline
\end{tabular}
\end{center}
11 rows in set (0.06 sec)

\textbf{mysql>} Insert into SchoolBus values (11, "Moti Bagh", 35, 32, 10, "Kisan Tours", 35000);
Query OK, 1 row affected (0.66 sec)

\textbf{mysql>} Select sum(DISTANCE) from SchoolBus where TRANSPORTER='Yadav Co.';
\begin{center}
\begin{tabular}{|l|}
\hline
sum(DISTANCE) \\
\hline
50 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.02 sec)

\textbf{mysql>} Select min(NOOFSTUDENTS) from SchoolBus;
\begin{center}
\begin{tabular}{|l|}
\hline
min(NOOFSTUDENTS) \\
\hline
100 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} Select avg(CHARGES) from SchoolBus where TRANSPORTER='Anand Travels';
\begin{center}
\begin{tabular}{|l|}
\hline
avg(CHARGES) \\
\hline
81666.66666666667 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.01 sec)

\textbf{mysql>} Select Distinct TRANSPORTER from SchoolBUs;
\begin{center}
\begin{tabular}{|l|}
\hline
TRANSPORTER \\
\hline
Shivam Travels \\
Anand Travels \\
Bhalla Co. \\
Yadav Co. \\
Speed Travels \\
Kisan Tours \\
\hline
\end{tabular}
\end{center}
6 rows in set (0.00 sec)

\section{Graduate}
\label{sec:org99d86cb}
\textbf{mysql>} Select NAME from GRADUATE where DIVI="I" order by NAME;
\begin{center}
\begin{tabular}{|l|}
\hline
NAME \\
\hline
ARJUN \\
DIVYA \\
DIWAKAR \\
JOHN \\
KARAN \\
REKHA \\
ROBERT \\
RUBINA \\
\hline
\end{tabular}
\end{center}
8 rows in set (0.02 sec)

\textbf{mysql>} Select NAME, STIPEND, SUBJECT, STIPEND*12 as "AMOUNT OF STIPEND RECIEVED IN A YEAR" from GRADUATE;
\begin{center}
\begin{tabular}{|l|l|l|l|}
\hline
NAME & STIPEND & SUBJECT & AMOUNT OF STIPEND RECIEVED IN A YEAR \\
\hline
KARAN & 400 & PHYSICS & 4800 \\
DIWAKAR & 450 & COMP SC & 5400 \\
DIVYA & 300 & CHEMISTRY & 3600 \\
REKHA & 350 & PHYSICS & 4200 \\
ARJUN & 500 & MATHS & 6000 \\
SABINA & 400 & CHEMISTRY & 4800 \\
JOHN & 250 & PHYSICS & 3000 \\
ROBERT & 450 & MATHS & 5400 \\
RUBINA & 500 & COMP SC & 6000 \\
VIKAS & 400 & MATHS & 4800 \\
\hline
\end{tabular}
\end{center}
10 rows in set (0.00 sec)

\textbf{mysql>} select count(*) from GRADUATE where SUBJECT="PHYSICS" or SUBJECT="COMP SC";
\begin{center}
\begin{tabular}{|l|}
\hline
count(*) \\
\hline
5 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.05 sec)

\textbf{mysql>} insert into GRADUATE values (11, "KAJOL", 300, "COMP SC", 75, 1);
Query OK, 1 row affected (0.11 sec)

\textbf{mysql>} Select min(AVERAGE) from GRADUATE where SUBJECT="PHYSICS";
\begin{center}
\begin{tabular}{|l|}
\hline
min(AVERAGE) \\
\hline
63 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} Select SUM(STIPEND) from GRADUATE where DIVI="II";
\begin{center}
\begin{tabular}{|l|}
\hline
SUM(STIPEND) \\
\hline
800 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} Select AVG(STIPEND) from GRADUATE where AVERAGE>=65;
\begin{center}
\begin{tabular}{|l|}
\hline
AVG(STIPEND) \\
\hline
420 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} select COUNT(DIstinct SUBJECT) from GRADUATE;
\begin{center}
\begin{tabular}{|l|}
\hline
COUNT(DIstinct SUBJECT) \\
\hline
4 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.06 sec)
