mysql.org
* Books and Issued
*mysql>* select BookName, AuthorName, Price from book where Publisher='First Publ.';
+--------------+-----------------+-------+
| BookName     | AuthorName      | Price |
+--------------+-----------------+-------+
| The Tears    | William Hopkins | 650   |
| Thunderbolts | Anna Roberts    | 750   |
+--------------+-----------------+-------+
2 rows in set (0.00 sec)

*mysql>* select BookName from book where Type='Text';
+-----------------+
| BookName        |
+-----------------+
| My First C++    |
| C++ Brain Works |
+-----------------+
2 rows in set (0.00 sec)

*mysql>* select BookName,Price from book order by price;
+-----------------+-------+
| BookName        | Price |
+-----------------+-------+
| My First C++    | 350   |
| C++ Brain Works | 350   |
| Fast Cook       | 355   |
| The Tears       | 650   |
| Thunderbolts    | 750   |
+-----------------+-------+
5 rows in set (0.00 sec)

*mysql>* update book set Price=Price+50 where Publisher='EPB';
Query OK, 1 row affected (0.15 sec)
Rows matched: 1  Changed: 1  Warnings: 0

*mysql>* select count(*) from book;
+----------+
| count(*) |
+----------+
|        5 |
+----------+
1 row in set (0.00 sec)

*mysql>* select book.bookid, bookname, quantityissued from book, issued where book.bookid=issued.bookid;
+--------+--------------+----------------+
| bookid | bookname     | quantityissued |
+--------+--------------+----------------+
| T0001  | My First C++ | 4              |
| C0001  | Fast Cook    | 5              |
| F0001  | The Tears    | 2              |
+--------+--------------+----------------+
3 rows in set (0.00 sec)

*mysql>* select max(price) from book where quantity>=15;
+------------+
| max(price) |
+------------+
| 750        |
+------------+
1 row in set (0.00 sec)

*mysql>* select bookname, authorname from book where publisher='First Publ.';
+--------------+-----------------+
| bookname     | authorname      |
+--------------+-----------------+
| The Tears    | William Hopkins |
| Thunderbolts | Anna Roberts    |
+--------------+-----------------+
2 rows in set (0.00 sec)

*mysql>* select count(distinct publisher) from book where price>=400;
+---------------------------+
| count(distinct publisher) |
+---------------------------+
|                         2 |
+---------------------------+
1 row in set (0.04 sec)

* Items and Company
** (I)
  *mysql>* select PNAME,PRICE*QTY from ITEMS,COMPANY where ITEMS.ID=COMPANY.ID and City='Mumbai';

+-----------+-----------+
| PNAME     | PRICE*QTY |
+-----------+-----------+
| Soap      |      2400 |
| Deodorant |      5750 |
+-----------+-----------+

2 rows in set (0.01 sec)

** (II)
*mysql>* select PNAME,COMP,PRICE from ITEMS,COMPANY where ITEMS.ID=COMPANY.ID;
+-------------+---------+-------+
| PNAME       | COMP    | PRICE |
+-------------+---------+-------+
| Soap        | HLL     |    12 |
| Paste       | Colgate |  39.5 |
| Deodorant   | HLL     |   125 |
| Hair Oil    | Paras   | 28.75 |
| Cold Cream  | Ponds   |    66 |
| Tooth Brush | Wipro   |    25 |
+-------------+---------+-------+
6 rows in set (0.00 sec)

** (III)
*mysql>* delete from ITEMS where MDATE<20070101;
Query OK, 2 rows affected (0.06 sec)

*mysql>* Select * from ITEMS;
+------+------------+-------+------------+------+
| ID   | PNAME      | PRICE | MDATE      | QTY  |
+------+------------+-------+------------+------+
| T001 | Soap       |    12 | 2007-03-11 |  200 |
| T003 | Deodorant  |   125 | 2007-06-12 |   46 |
| T004 | Hair Oil   | 28.75 | 2007-09-25 |  325 |
| T005 | Cold Cream |    66 | 2007-10-09 |  144 |
+------+------------+-------+------------+------+
4 rows in set (0.02 sec)

** (IV)
*mysql>* update ITEMS set QTY=QTY+20 where PNAME='Soap' or PNAME='Paste';
Query OK, 1 row affected (0.05 sec)
Rows matched: 1  Changed: 1  Warnings: 0

*mysql>* Select * fRom ITEMS;
+------+------------+-------+------------+------+
| ID   | PNAME      | PRICE | MDATE      | QTY  |
+------+------------+-------+------------+------+
| T001 | Soap       |    12 | 2007-03-11 |  220 |
| T003 | Deodorant  |   125 | 2007-06-12 |   46 |
| T004 | Hair Oil   | 28.75 | 2007-09-25 |  325 |
| T005 | Cold Cream |    66 | 2007-10-09 |  144 |
+------+------------+-------+------------+------+
4 rows in set (0.00 sec)

** (V)
*mysql>* select count(*) from ITEMS,COMPANY where ITEMS.ID=COMPANY.ID;
+----------+
| count(*) |
+----------+
|        4 |
+----------+
1 row in set (0.02 sec)

** (VII)
*mysql>* select count(*) from COMPANY where COMP like 'P____';
+----------+
| count(*) |
+----------+
|        2 |
+----------+
1 row in set (0.03 sec)

** (VIII)
*mysql>* select PNAME from ITEMS where QTY<100;
+-----------+
| PNAME     |
+-----------+
| Deodorant |
+-----------+
1 row in set (0.00 sec)

* Activity and Coach
*mysql>* select ActivityName, Acode from Activity order by Acode DESC;
+--------------+-------+
| ActivityName | Acode |
+--------------+-------+
| Discus Throw | 1008  |
| Long Jump    | 1005  |
| Shot Put     | 1003  |
| High Jump    | 1002  |
| Relay 100x4  | 1001  |
+--------------+-------+
5 rows in set (0.00 sec)

*mysql>* select prizemoney, participantsnum from activity;
+------------+-----------------+
| prizemoney | participantsnum |
+------------+-----------------+
| 10000      | 16              |
| 12000      | 10              |
| 8000       | 12              |
| 9000       | 12              |
| 15000      | 10              |
+------------+-----------------+
5 rows in set (0.00 sec)

*mysql>* select name, Acode from coach  order by acode;
+---------------+-------+
| name          | Acode |
+---------------+-------+
| Ahmad Hussain | 1001  |
| Janila        | 1001  |
| Naaz          | 1003  |
| Ravinder      | 1008  |
+---------------+-------+
4 rows in set (0.00 sec)

*mysql>* select * from ACTIVITY where ScheduleDate<'20040101' order by ParticipantsNum;
+-------+--------------+-----------------+------------+--------------+
| ACode | ActivityName | ParticipantsNum | PrizeMoney | ScheduleDate |
+-------+--------------+-----------------+------------+--------------+
| 1002  | High Jump    | 10              | 12000      | 2003-12-12   |
+-------+--------------+-----------------+------------+--------------+
1 row in set (0.00 sec)

*mysql>* Select count(distinct ParticipantsNum) from activity;
+---------------------------------+
| count(distinct ParticipantsNum) |
+---------------------------------+
|                               3 |
+---------------------------------+
1 row in set (0.00 sec)

*mysql>* Select max(ScheduleDate), min(ScheduleDate) from activity;
+-------------------+-------------------+
| max(ScheduleDate) | min(ScheduleDate) |
+-------------------+-------------------+
| 2004-03-19        | 2003-12-12        |
+-------------------+-------------------+
1 row in set (0.00 sec)

*mysql>* select sum(PrizeMoney) from Activity;
+-----------------+
| sum(PrizeMoney) |
+-----------------+
|           54000 |
+-----------------+
1 row in set (0.00 sec)

*mysql>* SELECT DISTINCT ParticipantsNum  from ACTIVITY;
+-----------------+
| ParticipantsNum |
+-----------------+
| 16              |
| 10              |
| 12              |
+-----------------+
3 rows in set (0.00 sec)

*mysql>* select activity.acode, activityname, name from activity,coach where prizemoney>10000 and activity.acode=coach.acode;
+-------+--------------+----------+
| acode | activityname | name     |
+-------+--------------+----------+
| 1008  | Discus Throw | Ravinder |
+-------+--------------+----------+
1 row in set (0.00 sec)

