mysql.tex

\section{Books and Issued}
\label{sec:orgc321d10}
\textbf{mysql>} select BookName, AuthorName, Price from book where Publisher='First Publ.';
\begin{center}
\begin{tabular}{|l|l|l|}
\hline
BookName & AuthorName & Price \\
\hline
The Tears & William Hopkins & 650 \\
Thunderbolts & Anna Roberts & 750 \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.00 sec)

\textbf{mysql>} select BookName from book where Type='Text';
\begin{center}
\begin{tabular}{|l|}
\hline
BookName \\
\hline
My First C++ \\
C++ Brain Works \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.00 sec)

\textbf{mysql>} select BookName,Price from book order by price;
\begin{center}
\begin{tabular}{|l|l|}
\hline
BookName & Price \\
\hline
My First C++ & 350 \\
C++ Brain Works & 350 \\
Fast Cook & 355 \\
The Tears & 650 \\
Thunderbolts & 750 \\
\hline
\end{tabular}
\end{center}
5 rows in set (0.00 sec)

\textbf{mysql>} update book set Price=Price+50 where Publisher='EPB';
Query OK, 1 row affected (0.15 sec)
Rows matched: 1  Changed: 1  Warnings: 0

\textbf{mysql>} select count(*) from book;
\begin{center}
\begin{tabular}{|l|}
\hline
count(*) \\
\hline
5 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} select book.bookid, bookname, quantityissued from book, issued where book.bookid=issued.bookid;
\begin{center}
\begin{tabular}{|l|l|l|}
\hline
bookid & bookname & quantityissued \\
\hline
T0001 & My First C++ & 4 \\
C0001 & Fast Cook & 5 \\
F0001 & The Tears & 2 \\
\hline
\end{tabular}
\end{center}
3 rows in set (0.00 sec)

\textbf{mysql>} select max(price) from book where quantity>=15;
\begin{center}
\begin{tabular}{|l|}
\hline
max(price) \\
\hline
750 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} select bookname, authorname from book where publisher='First Publ.';
\begin{center}
\begin{tabular}{|l|l|}
\hline
bookname & authorname \\
\hline
The Tears & William Hopkins \\
Thunderbolts & Anna Roberts \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.00 sec)

\textbf{mysql>} select count(distinct publisher) from book where price>=400;
\begin{center}
\begin{tabular}{|l|}
\hline
count(distinct publisher) \\
\hline
2 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.04 sec)

\section{Items and Company}
\label{sec:orgd74b8d0}
\subsection{(I)}
\label{sec:orgd2723a2}
\textbf{mysql>} select PNAME,PRICE*QTY from ITEMS,COMPANY where ITEMS.ID=COMPANY.ID and City='Mumbai';

\begin{center}
\begin{tabular}{|l|l|}
\hline
PNAME & PRICE*QTY \\
\hline
Soap & 2400 \\
Deodorant & 5750 \\
\hline
\end{tabular}
\end{center}

2 rows in set (0.01 sec)

\subsection{(II)}
\label{sec:org64817aa}
\textbf{mysql>} select PNAME,COMP,PRICE from ITEMS,COMPANY where ITEMS.ID=COMPANY.ID;
\begin{center}
\begin{tabular}{|l|l|l|}
\hline
PNAME & COMP & PRICE \\
\hline
Soap & HLL & 12 \\
Paste & Colgate & 39.5 \\
Deodorant & HLL & 125 \\
Hair Oil & Paras & 28.75 \\
Cold Cream & Ponds & 66 \\
Tooth Brush & Wipro & 25 \\
\hline
\end{tabular}
\end{center}
6 rows in set (0.00 sec)

\subsection{(III)}
\label{sec:orga07b6bc}
\textbf{mysql>} delete from ITEMS where MDATE<20070101;
Query OK, 2 rows affected (0.06 sec)

\textbf{mysql>} Select * from ITEMS;
\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
ID & PNAME & PRICE & MDATE & QTY \\
\hline
T001 & Soap & 12 & 2007-03-11 & 200 \\
T003 & Deodorant & 125 & 2007-06-12 & 46 \\
T004 & Hair Oil & 28.75 & 2007-09-25 & 325 \\
T005 & Cold Cream & 66 & 2007-10-09 & 144 \\
\hline
\end{tabular}
\end{center}
4 rows in set (0.02 sec)

\subsection{(IV)}
\label{sec:orga869dc9}
\textbf{mysql>} update ITEMS set QTY=QTY+20 where PNAME='Soap' or PNAME='Paste';
Query OK, 1 row affected (0.05 sec)
Rows matched: 1  Changed: 1  Warnings: 0

\textbf{mysql>} Select * fRom ITEMS;
\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
ID & PNAME & PRICE & MDATE & QTY \\
\hline
T001 & Soap & 12 & 2007-03-11 & 220 \\
T003 & Deodorant & 125 & 2007-06-12 & 46 \\
T004 & Hair Oil & 28.75 & 2007-09-25 & 325 \\
T005 & Cold Cream & 66 & 2007-10-09 & 144 \\
\hline
\end{tabular}
\end{center}
4 rows in set (0.00 sec)

\subsection{(V)}
\label{sec:orgc2c62ec}
\textbf{mysql>} select count(*) from ITEMS,COMPANY where ITEMS.ID=COMPANY.ID;
\begin{center}
\begin{tabular}{|l|}
\hline
count(*) \\
\hline
4 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.02 sec)

\subsection{(VII)}
\label{sec:org3d1fa7e}
\textbf{mysql>} select count(*) from COMPANY where COMP like 'P\_\_\_\_';
\begin{center}
\begin{tabular}{|l|}
\hline
count(*) \\
\hline
2 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.03 sec)

\subsection{(VIII)}
\label{sec:org9981cae}
\textbf{mysql>} select PNAME from ITEMS where QTY<100;
\begin{center}
\begin{tabular}{|l|}
\hline
PNAME \\
\hline
Deodorant \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\section{Activity and Coach}
\label{sec:org135ff13}
\textbf{mysql>} select ActivityName, Acode from Activity order by Acode DESC;
\begin{center}
\begin{tabular}{|l|l|}
\hline
ActivityName & Acode \\
\hline
Discus Throw & 1008 \\
Long Jump & 1005 \\
Shot Put & 1003 \\
High Jump & 1002 \\
Relay 100x4 & 1001 \\
\hline
\end{tabular}
\end{center}
5 rows in set (0.00 sec)

\textbf{mysql>} select prizemoney, participantsnum from activity;
\begin{center}
\begin{tabular}{|l|l|}
\hline
prizemoney & participantsnum \\
\hline
10000 & 16 \\
12000 & 10 \\
8000 & 12 \\
9000 & 12 \\
15000 & 10 \\
\hline
\end{tabular}
\end{center}
5 rows in set (0.00 sec)

\textbf{mysql>} select name, Acode from coach  order by acode;
\begin{center}
\begin{tabular}{|l|l|}
\hline
name & Acode \\
\hline
Ahmad Hussain & 1001 \\
Janila & 1001 \\
Naaz & 1003 \\
Ravinder & 1008 \\
\hline
\end{tabular}
\end{center}
4 rows in set (0.00 sec)

\textbf{mysql>} select * from ACTIVITY where ScheduleDate<'20040101' order by ParticipantsNum;
\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
ACode & ActivityName & ParticipantsNum & PrizeMoney & ScheduleDate \\
\hline
1002 & High Jump & 10 & 12000 & 2003-12-12 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} Select count(distinct ParticipantsNum) from activity;
\begin{center}
\begin{tabular}{|l|}
\hline
count(distinct ParticipantsNum) \\
\hline
3 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} Select max(ScheduleDate), min(ScheduleDate) from activity;
\begin{center}
\begin{tabular}{|l|l|}
\hline
max(ScheduleDate) & min(ScheduleDate) \\
\hline
2004-03-19 & 2003-12-12 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} select sum(PrizeMoney) from Activity;
\begin{center}
\begin{tabular}{|l|}
\hline
sum(PrizeMoney) \\
\hline
54000 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} SELECT DISTINCT ParticipantsNum  from ACTIVITY;
\begin{center}
\begin{tabular}{|l|}
\hline
ParticipantsNum \\
\hline
16 \\
10 \\
12 \\
\hline
\end{tabular}
\end{center}
3 rows in set (0.00 sec)

\textbf{mysql>} select activity.acode, activityname, name from activity,coach where prizemoney>10000 and activity.acode=coach.acode;
\begin{center}
\begin{tabular}{|l|l|l|}
\hline
acode & activityname & name \\
\hline
1008 & Discus Throw & Ravinder \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)
