mysql.org
* Employees and EMPSALARY
*mysql>* select * from employees;
+-------+-----------+----------+-------------------+------------+
| EmpId | FirstName | LastName | Address           | City       |
+-------+-----------+----------+-------------------+------------+
| 10    | Ravi      | Kumar    | Raj Nagar         | GZB        |
| 105   | Harry     | Waltor   | Gandhi Nagar      | GZB        |
| 152   | Sam       | Tones    | 33 Elm St.        | Paris      |
| 215   | Sarah     | Ackerman | 440 U.S. 110      | Upton      |
| 244   | Manila    | Sengupta | 24 Friends Street | New Delhi  |
| 300   | Robert    | Samuel   | 9 Fifth Cross     | Washington |
| 335   | Ritu      | Tondon   | Shastri Nagar     | GZB        |
| 400   | Rachel    | Lee      | 121 Harrison St.  | New York   |
| 441   | Peter     | Thompson | 11 Red Road       | Paris      |
+-------+-----------+----------+-------------------+------------+
9 rows in set (0.11 sec)

*mysql>* select * from empsalary;
+-------+--------+----------+-------------+
| EmpId | Salary | Benefits | Designation |
+-------+--------+----------+-------------+
| 10    | 75000  | 15000    | Manager     |
| 105   | 65000  | 15000    | Manager     |
| 152   | 80000  | 25000    | Director    |
| 215   | 75000  | 12500    | Manager     |
| 244   | 50000  | 12000    | Clerk       |
| 300   | 45000  | 10000    | Clerk       |
| 335   | 40000  | 10000    | Clerk       |
| 400   | 32000  | 7500     | Salesman    |
| 441   | 28000  | 7500     | Salesman    |
+-------+--------+----------+-------------+
9 rows in set (0.11 sec)

*mysql>* select firstname, lastname, address, city from employees where city='Paris';
+-----------+----------+-------------+-------+
| firstname | lastname | address     | city  |
+-----------+----------+-------------+-------+
| Sam       | Tones    | 33 Elm St.  | Paris |
| Peter     | Thompson | 11 Red Road | Paris |
+-----------+----------+-------------+-------+
2 rows in set (0.00 sec)

*mysql>* select * from employees order by firstname desc;
+-------+-----------+----------+-------------------+------------+
| EmpId | FirstName | LastName | Address           | City       |
+-------+-----------+----------+-------------------+------------+
| 215   | Sarah     | Ackerman | 440 U.S. 110      | Upton      |
| 152   | Sam       | Tones    | 33 Elm St.        | Paris      |
| 300   | Robert    | Samuel   | 9 Fifth Cross     | Washington |
| 335   | Ritu      | Tondon   | Shastri Nagar     | GZB        |
| 10    | Ravi      | Kumar    | Raj Nagar         | GZB        |
| 400   | Rachel    | Lee      | 121 Harrison St.  | New York   |
| 441   | Peter     | Thompson | 11 Red Road       | Paris      |
| 244   | Manila    | Sengupta | 24 Friends Street | New Delhi  |
| 105   | Harry     | Waltor   | Gandhi Nagar      | GZB        |
+-------+-----------+----------+-------------------+------------+
9 rows in set (0.00 sec)

*mysql>* select firstname, lastname, salary from employees, empsalary where employees.empid=empsalary.empid;
+-----------+----------+--------+
| firstname | lastname | salary |
+-----------+----------+--------+
| Ravi      | Kumar    | 75000  |
| Harry     | Waltor   | 65000  |
| Sam       | Tones    | 80000  |
| Sarah     | Ackerman | 75000  |
| Manila    | Sengupta | 50000  |
| Robert    | Samuel   | 45000  |
| Ritu      | Tondon   | 40000  |
| Rachel    | Lee      | 32000  |
| Peter     | Thompson | 28000  |
+-----------+----------+--------+
9 rows in set (0.06 sec)

*mysql>* select max(salary) from empsalary where designation="Manager" or designation="Clerk";
+-------------+
| max(salary) |
+-------------+
| 75000       |
+-------------+
1 row in set (0.00 sec)

*mysql>*
*mysql>* select firstname, salary from employees, empsalary where designation="Salesman" and Employees.empid=Empsalary.empid;
+-----------+--------+
| firstname | salary |
+-----------+--------+
| Rachel    | 32000  |
| Peter     | 28000  |
+-----------+--------+
2 rows in set (0.00 sec)

*mysql>* select count(distinct designation) from empsalary;
+-----------------------------+
| count(distinct designation) |
+-----------------------------+
|                           4 |
+-----------------------------+
1 row in set (0.00 sec)

*mysql>* select designation, sum(salary) from empsalary group by designation having count(*)>2;
+-------------+-------------+
| designation | sum(salary) |
+-------------+-------------+
| Clerk       |      135000 |
| Manager     |      215000 |
+-------------+-------------+
2 rows in set (0.00 sec)

*mysql>* select sum(benefits) from empsalary where designation="Clerk";
+---------------+
| sum(benefits) |
+---------------+
|         32000 |
+---------------+
1 row in set (0.02 sec)

