mysql.tex

\section{Employees and EMPSALARY}
\label{sec:org6bc275e}
\textbf{mysql>} select * from employees;
\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
EmpId & FirstName & LastName & Address & City \\
\hline
10 & Ravi & Kumar & Raj Nagar & GZB \\
105 & Harry & Waltor & Gandhi Nagar & GZB \\
152 & Sam & Tones & 33 Elm St. & Paris \\
215 & Sarah & Ackerman & 440 U.S. 110 & Upton \\
244 & Manila & Sengupta & 24 Friends Street & New Delhi \\
300 & Robert & Samuel & 9 Fifth Cross & Washington \\
335 & Ritu & Tondon & Shastri Nagar & GZB \\
400 & Rachel & Lee & 121 Harrison St. & New York \\
441 & Peter & Thompson & 11 Red Road & Paris \\
\hline
\end{tabular}
\end{center}
9 rows in set (0.11 sec)

\textbf{mysql>} select * from empsalary;
\begin{center}
\begin{tabular}{|l|l|l|l|}
\hline
EmpId & Salary & Benefits & Designation \\
\hline
10 & 75000 & 15000 & Manager \\
105 & 65000 & 15000 & Manager \\
152 & 80000 & 25000 & Director \\
215 & 75000 & 12500 & Manager \\
244 & 50000 & 12000 & Clerk \\
300 & 45000 & 10000 & Clerk \\
335 & 40000 & 10000 & Clerk \\
400 & 32000 & 7500 & Salesman \\
441 & 28000 & 7500 & Salesman \\
\hline
\end{tabular}
\end{center}
9 rows in set (0.11 sec)

\textbf{mysql>} select firstname, lastname, address, city from employees where city='Paris';
\begin{center}
\begin{tabular}{|l|l|l|l|}
\hline
firstname & lastname & address & city \\
\hline
Sam & Tones & 33 Elm St. & Paris \\
Peter & Thompson & 11 Red Road & Paris \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.00 sec)

\textbf{mysql>} select * from employees order by firstname desc;
\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
EmpId & FirstName & LastName & Address & City \\
\hline
215 & Sarah & Ackerman & 440 U.S. 110 & Upton \\
152 & Sam & Tones & 33 Elm St. & Paris \\
300 & Robert & Samuel & 9 Fifth Cross & Washington \\
335 & Ritu & Tondon & Shastri Nagar & GZB \\
10 & Ravi & Kumar & Raj Nagar & GZB \\
400 & Rachel & Lee & 121 Harrison St. & New York \\
441 & Peter & Thompson & 11 Red Road & Paris \\
244 & Manila & Sengupta & 24 Friends Street & New Delhi \\
105 & Harry & Waltor & Gandhi Nagar & GZB \\
\hline
\end{tabular}
\end{center}
9 rows in set (0.00 sec)

\textbf{mysql>} select firstname, lastname, salary from employees, empsalary where employees.empid=empsalary.empid;
\begin{center}
\begin{tabular}{|l|l|l|}
\hline
firstname & lastname & salary \\
\hline
Ravi & Kumar & 75000 \\
Harry & Waltor & 65000 \\
Sam & Tones & 80000 \\
Sarah & Ackerman & 75000 \\
Manila & Sengupta & 50000 \\
Robert & Samuel & 45000 \\
Ritu & Tondon & 40000 \\
Rachel & Lee & 32000 \\
Peter & Thompson & 28000 \\
\hline
\end{tabular}
\end{center}
9 rows in set (0.06 sec)

\textbf{mysql>} select max(salary) from empsalary where designation="Manager" or designation="Clerk";
\begin{center}
\begin{tabular}{|l|}
\hline
max(salary) \\
\hline
75000 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>}
\textbf{mysql>} select firstname, salary from employees, empsalary where designation="Salesman" and Employees.empid=Empsalary.empid;
\begin{center}
\begin{tabular}{|l|l|}
\hline
firstname & salary \\
\hline
Rachel & 32000 \\
Peter & 28000 \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.00 sec)

\textbf{mysql>} select count(distinct designation) from empsalary;
\begin{center}
\begin{tabular}{|l|}
\hline
count(distinct designation) \\
\hline
4 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.00 sec)

\textbf{mysql>} select designation, sum(salary) from empsalary group by designation having count(*)>2;
\begin{center}
\begin{tabular}{|l|l|}
\hline
designation & sum(salary) \\
\hline
Clerk & 135000 \\
Manager & 215000 \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.00 sec)

\textbf{mysql>} select sum(benefits) from empsalary where designation="Clerk";
\begin{center}
\begin{tabular}{|l|}
\hline
sum(benefits) \\
\hline
32000 \\
\hline
\end{tabular}
\end{center}
1 row in set (0.02 sec)
