mysql.org
* Products
*mysql>* create table products(productID integer, productcode varchar(30),name varchar(30), quantity integer,price decimal(10,2));
Query OK, 0 rows affected (0.09 sec)

*mysql>* insert into products values(1001,"pen","pen red",5000,1.23);
Query OK, 1 row affected (0.03 sec)

*mysql>* insert into products values(1002,"pen","pen blue",8000,1.25);
Query OK, 1 row affected (0.04 sec)

*mysql>* insert into products values(1003,"pen","pen black",2000,1.25);
Query OK, 1 row affected (0.03 sec)

*mysql>* insert into products values(1004,"pec","pencil 2B",10000,0.48);
Query OK, 1 row affected (0.04 sec)

*mysql>* insert into products values(1005,"pec","pencil 2H",8000,0.49);
Query OK, 1 row affected (0.03 sec)

*mysql>* insert into products values(1006,"pec","pencil HB",0,9999999.99);
Query OK, 1 row affected (0.07 sec)

*mysql>* select * from products;
+-----------+-------------+-----------+----------+------------+
| productID | productcode | name      | quantity | price      |
+-----------+-------------+-----------+----------+------------+
|      1001 | pen         | pen red   |     5000 |       1.23 |
|      1002 | pen         | pen blue  |     8000 |       1.25 |
|      1003 | pen         | pen black |     2000 |       1.25 |
|      1004 | pec         | pencil 2B |    10000 |       0.48 |
|      1005 | pec         | pencil 2H |     8000 |       0.49 |
|      1006 | pec         | pencil HB |        0 | 9999999.99 |
+-----------+-------------+-----------+----------+------------+
6 rows in set (0.11 sec)

*mysql>* select name,price from products where price<1.0;
+-----------+-------+
| name      | price |
+-----------+-------+
| pencil 2B |  0.48 |
| pencil 2H |  0.49 |
+-----------+-------+
2 rows in set (0.04 sec)

*mysql>* select name,quantity from products where quantity <= 2000;
+-----------+----------+
| name      | quantity |
+-----------+----------+
| pen black |     2000 |
| pencil HB |        0 |
+-----------+----------+
2 rows in set (0.00 sec)

*mysql>* select name,price from products where productcode="pen";
+-----------+-------+
| name      | price |
+-----------+-------+
| pen red   |  1.23 |
| pen blue  |  1.25 |
| pen black |  1.25 |
+-----------+-------+
3 rows in set (0.01 sec)

*mysql>* select name,price from products where name like "pencil%";
+-----------+------------+
| name      | price      |
+-----------+------------+
| pencil 2B |       0.48 |
| pencil 2H |       0.49 |
| pencil HB | 9999999.99 |
+-----------+------------+
3 rows in set (0.00 sec)

*mysql>* select name,price from products where name like "p_%";
+-----------+------------+
| name      | price      |
+-----------+------------+
| pen red   |       1.23 |
| pen blue  |       1.25 |
| pen black |       1.25 |
| pencil 2B |       0.48 |
| pencil 2H |       0.49 |
| pencil HB | 9999999.99 |
+-----------+------------+
6 rows in set (0.00 sec)

*mysql>* select*from products where quantity>=5000 and name like "pen%";
+-----------+-------------+-----------+----------+-------+
| productID | productcode | name      | quantity | price |
+-----------+-------------+-----------+----------+-------+
|      1001 | pen         | pen red   |     5000 |  1.23 |
|      1002 | pen         | pen blue  |     8000 |  1.25 |
|      1004 | pec         | pencil 2B |    10000 |  0.48 |
|      1005 | pec         | pencil 2H |     8000 |  0.49 |
+-----------+-------------+-----------+----------+-------+
4 rows in set (0.00 sec)

*mysql>* select*from products where quantity>=5000 and name like "pen%" and price <1.24;
+-----------+-------------+-----------+----------+-------+
| productID | productcode | name      | quantity | price |
+-----------+-------------+-----------+----------+-------+
|      1001 | pen         | pen red   |     5000 |  1.23 |
|      1004 | pec         | pencil 2B |    10000 |  0.48 |
|      1005 | pec         | pencil 2H |     8000 |  0.49 |
+-----------+-------------+-----------+----------+-------+
3 rows in set (0.00 sec)

*mysql>* select*from products where not(quantity>=5000 and name like "pen%");
+-----------+-------------+-----------+----------+------------+
| productID | productcode | name      | quantity | price      |
+-----------+-------------+-----------+----------+------------+
|      1003 | pen         | pen black |     2000 |       1.25 |
|      1006 | pec         | pencil HB |        0 | 9999999.99 |
+-----------+-------------+-----------+----------+------------+
2 rows in set (0.00 sec)

*mysql>* select*from products where name in("pen red","pen black");
+-----------+-------------+-----------+----------+-------+
| productID | productcode | name      | quantity | price |
+-----------+-------------+-----------+----------+-------+
|      1001 | pen         | pen red   |     5000 |  1.23 |
|      1003 | pen         | pen black |     2000 |  1.25 |
+-----------+-------------+-----------+----------+-------+
2 rows in set (0.00 sec)

*mysql>* select*from products where (price between 1.0 and 2.0) or (quantity between 1000 and 2000);
+-----------+-------------+-----------+----------+-------+
| productID | productcode | name      | quantity | price |
+-----------+-------------+-----------+----------+-------+
|      1001 | pen         | pen red   |     5000 |  1.23 |
|      1002 | pen         | pen blue  |     8000 |  1.25 |
|      1003 | pen         | pen black |     2000 |  1.25 |
+-----------+-------------+-----------+----------+-------+
3 rows in set (0.08 sec)

*mysql>* select*from products where not((price between 1.0 and 2.0) or (quantity between 1000 and 2000));
+-----------+-------------+-----------+----------+------------+
| productID | productcode | name      | quantity | price      |
+-----------+-------------+-----------+----------+------------+
|      1004 | pec         | pencil 2B |    10000 |       0.48 |
|      1005 | pec         | pencil 2H |     8000 |       0.49 |
|      1006 | pec         | pencil HB |        0 | 9999999.99 |
+-----------+-------------+-----------+----------+------------+
3 rows in set (0.00 sec)

*mysql>* insert into products values(1006,null,null,null,null);
Query OK, 1 row affected (0.13 sec)

*mysql>* select*from products where productcode is null;
+-----------+-------------+------+----------+-------+
| productID | productcode | name | quantity | price |
+-----------+-------------+------+----------+-------+
|      1006 | NULL        | NULL |     NULL |  NULL |
+-----------+-------------+------+----------+-------+
1 row in set (0.00 sec)

*mysql>* select*from products where productcode= null;
Empty set (0.00 sec)

