mysql.org
* Sender and Recipient
*mysql>* create table sender(senderID varchar(20) primary key, sendername varchar(20),senderaddress varchar(30),sendercity varchar(30));
Query OK, 0 rows affected (0.36 sec)

*mysql>* insert into sender values("ND01","R Jain","2,ABC Appts","New Delhi");
Query OK, 1 row affected (0.15 sec)

*mysql>* insert into sender values("MU02","H Sinha","12 Newton","Mumbai");
Query OK, 1 row affected (0.03 sec)

*mysql>* insert into sender values("MU15","S Jha","27/A Park Street","Mumbai");
Query OK, 1 row affected (0.04 sec)

*mysql>* insert into sender values("ND50","T Prasad","122-K,SDA","New Delhi");
Query OK, 1 row affected (0.04 sec)

*mysql>* create table recepient(recID varchar(10), senderID varchar(20), recname varchar(30),recaddress varchar (20),reccity varchar(20),foreign key(senderID) references sender(senderID));
Query OK, 0 rows affected (0.10 sec)

*mysql>* insert into recepient values("KO05","ND01","R Bajpayee","5,Central Avenue","Kolkata");
Query OK, 1 row affected (0.05 sec)

*mysql>* insert into recepient values("ND08","MU02","S Mahajan","116,A Vihar","New Delhi");
Query OK, 1 row affected (0.14 sec)

*mysql>* insert into recepient values("MU19","ND01","H Singh","2A,Andheri East","Mumbai");
Query OK, 1 row affected (0.04 sec)

*mysql>* insert into recepient values("MU32","MU15","P k Swamy","B5, CS Terminus","Mumbai");
Query OK, 1 row affected (0.04 sec)

*mysql>* insert into recepient values("ND48","ND50","S Tripathi","13,B1D,MayurVihar","New Delhi");
Query OK, 1 row affected (0.13 sec)

*mysql>* select*from sender where sendercity="Mumbai";
+----------+------------+------------------+------------+
| senderID | sendername | senderaddress    | sendercity |
+----------+------------+------------------+------------+
| MU02     | H Sinha    | 12 Newton        | Mumbai     |
| MU15     | S Jha      | 27/A Park Street | Mumbai     |
+----------+------------+------------------+------------+
2 rows in set (0.14 sec)

*mysql>* select recID, sendername,senderaddress,recname,recaddress from sender,recepient where sender.senderID=recepient.senderID;
+-------+------------+------------------+------------+-------------------+
| recID | sendername | senderaddress    | recname    | recaddress        |
+-------+------------+------------------+------------+-------------------+
| ND08  | H Sinha    | 12 Newton        | S Mahajan  | 116,A Vihar       |
| MU32  | S Jha      | 27/A Park Street | P k Swamy  | B5, CS Terminus   |
| KO05  | R Jain     | 2,ABC Appts      | R Bajpayee | 5,Central Avenue  |
| MU19  | R Jain     | 2,ABC Appts      | H Singh    | 2A,Andheri East   |
| ND48  | T Prasad   | 122-K,SDA        | S Tripathi | 13,B1D,MayurVihar |
+-------+------------+------------------+------------+-------------------+
5 rows in set (0.00 sec)

*mysql>* select*from recepient order by recname;
+-------+----------+------------+-------------------+-----------+
| recID | senderID | recname    | recaddress        | reccity   |
+-------+----------+------------+-------------------+-----------+
| MU19  | ND01     | H Singh    | 2A,Andheri East   | Mumbai    |
| MU32  | MU15     | P k Swamy  | B5, CS Terminus   | Mumbai    |
| KO05  | ND01     | R Bajpayee | 5,Central Avenue  | Kolkata   |
| ND08  | MU02     | S Mahajan  | 116,A Vihar       | New Delhi |
| ND48  | ND50     | S Tripathi | 13,B1D,MayurVihar | New Delhi |
+-------+----------+------------+-------------------+-----------+
5 rows in set (0.00 sec)

*mysql>* select count(recname),reccity from recepient group by reccity;
+----------------+-----------+
| count(recname) | reccity   |
+----------------+-----------+
|              1 | Kolkata   |
|              2 | Mumbai    |
|              2 | New Delhi |
+----------------+-----------+
3 rows in set (0.04 sec)

*mysql>* select distinct sendercity from sender;
+------------+
| sendercity |
+------------+
| Mumbai     |
| New Delhi  |
+------------+
2 rows in set (0.00 sec)

*mysql>* select recname,recaddress from recepient where reccity not in("Mumbai","Kolkata");
+------------+-------------------+
| recname    | recaddress        |
+------------+-------------------+
| S Mahajan  | 116,A Vihar       |
| S Tripathi | 13,B1D,MayurVihar |
+------------+-------------------+
2 rows in set (0.00 sec)

*mysql>* select recID,recname from recepient where senderID="MU02" or senderID="ND50";
+-------+------------+
| recID | recname    |
+-------+------------+
| ND08  | S Mahajan  |
| ND48  | S Tripathi |
+-------+------------+
2 rows in set (0.00 sec)

*mysql>* select A.sendername, B.recname from sender A,recepient B where A.senderID=B.senderID and B.reccity="Mumbai";
+------------+-----------+
| sendername | recname   |
+------------+-----------+
| S Jha      | P k Swamy |
| R Jain     | H Singh   |
+------------+-----------+
2 rows in set (0.00 sec)
