mysql.tex

\section{Sender and Recipient}
\label{sec:org07584f5}
\textbf{mysql>} create table sender(senderID varchar(20) primary key, sendername varchar(20),senderaddress varchar(30),sendercity varchar(30));
Query OK, 0 rows affected (0.36 sec)

\textbf{mysql>} insert into sender values("ND01","R Jain","2,ABC Appts","New Delhi");
Query OK, 1 row affected (0.15 sec)

\textbf{mysql>} insert into sender values("MU02","H Sinha","12 Newton","Mumbai");
Query OK, 1 row affected (0.03 sec)

\textbf{mysql>} insert into sender values("MU15","S Jha","27/A Park Street","Mumbai");
Query OK, 1 row affected (0.04 sec)

\textbf{mysql>} insert into sender values("ND50","T Prasad","122-K,SDA","New Delhi");
Query OK, 1 row affected (0.04 sec)

\textbf{mysql>} create table recepient(recID varchar(10), senderID varchar(20), recname varchar(30),recaddress varchar (20),reccity varchar(20),foreign key(senderID) references sender(senderID));
Query OK, 0 rows affected (0.10 sec)

\textbf{mysql>} insert into recepient values("KO05","ND01","R Bajpayee","5,Central Avenue","Kolkata");
Query OK, 1 row affected (0.05 sec)

\textbf{mysql>} insert into recepient values("ND08","MU02","S Mahajan","116,A Vihar","New Delhi");
Query OK, 1 row affected (0.14 sec)

\textbf{mysql>} insert into recepient values("MU19","ND01","H Singh","2A,Andheri East","Mumbai");
Query OK, 1 row affected (0.04 sec)

\textbf{mysql>} insert into recepient values("MU32","MU15","P k Swamy","B5, CS Terminus","Mumbai");
Query OK, 1 row affected (0.04 sec)

\textbf{mysql>} insert into recepient values("ND48","ND50","S Tripathi","13,B1D,MayurVihar","New Delhi");
Query OK, 1 row affected (0.13 sec)

\textbf{mysql>} select*from sender where sendercity="Mumbai";
\begin{center}
\begin{tabular}{|l|l|l|l|}
\hline
senderID & sendername & senderaddress & sendercity \\
\hline
MU02 & H Sinha & 12 Newton & Mumbai \\
MU15 & S Jha & 27/A Park Street & Mumbai \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.14 sec)

\textbf{mysql>} select recID, sendername,senderaddress,recname,recaddress from sender,recepient where sender.senderID=recepient.senderID;
\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
recID & sendername & senderaddress & recname & recaddress \\
\hline
ND08 & H Sinha & 12 Newton & S Mahajan & 116,A Vihar \\
MU32 & S Jha & 27/A Park Street & P k Swamy & B5, CS Terminus \\
KO05 & R Jain & 2,ABC Appts & R Bajpayee & 5,Central Avenue \\
MU19 & R Jain & 2,ABC Appts & H Singh & 2A,Andheri East \\
ND48 & T Prasad & 122-K,SDA & S Tripathi & 13,B1D,MayurVihar \\
\hline
\end{tabular}
\end{center}
5 rows in set (0.00 sec)

\textbf{mysql>} select*from recepient order by recname;
\begin{center}
\begin{tabular}{|l|l|l|l|l|}
\hline
recID & senderID & recname & recaddress & reccity \\
\hline
MU19 & ND01 & H Singh & 2A,Andheri East & Mumbai \\
MU32 & MU15 & P k Swamy & B5, CS Terminus & Mumbai \\
KO05 & ND01 & R Bajpayee & 5,Central Avenue & Kolkata \\
ND08 & MU02 & S Mahajan & 116,A Vihar & New Delhi \\
ND48 & ND50 & S Tripathi & 13,B1D,MayurVihar & New Delhi \\
\hline
\end{tabular}
\end{center}
5 rows in set (0.00 sec)

\textbf{mysql>} select count(recname),reccity from recepient group by reccity;
\begin{center}
\begin{tabular}{|l|l|}
\hline
count(recname) & reccity \\
\hline
1 & Kolkata \\
2 & Mumbai \\
2 & New Delhi \\
\hline
\end{tabular}
\end{center}
3 rows in set (0.04 sec)

\textbf{mysql>} select distinct sendercity from sender;
\begin{center}
\begin{tabular}{|l|}
\hline
sendercity \\
\hline
Mumbai \\
New Delhi \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.00 sec)

\textbf{mysql>} select recname,recaddress from recepient where reccity not in("Mumbai","Kolkata");
\begin{center}
\begin{tabular}{|l|l|}
\hline
recname & recaddress \\
\hline
S Mahajan & 116,A Vihar \\
S Tripathi & 13,B1D,MayurVihar \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.00 sec)

\textbf{mysql>} select recID,recname from recepient where senderID="MU02" or senderID="ND50";
\begin{center}
\begin{tabular}{|l|l|}
\hline
recID & recname \\
\hline
ND08 & S Mahajan \\
ND48 & S Tripathi \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.00 sec)

\textbf{mysql>} select A.sendername, B.recname from sender A,recepient B where A.senderID=B.senderID and B.reccity="Mumbai";
\begin{center}
\begin{tabular}{|l|l|}
\hline
sendername & recname \\
\hline
S Jha & P k Swamy \\
R Jain & H Singh \\
\hline
\end{tabular}
\end{center}
2 rows in set (0.00 sec)
\end{document}